In [1]:
import numpy as np
import pandas as pd

Make data in format such as excel sheet.

In [2]:
dict1 = {
    "name":['dhruvi', 'mirali', 'ila'],
    "marks": [92, 94, 91],
    "city": ["Bharuch", "Visavadar", "Junagadh"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0  dhruvi     92    Bharuch
1  mirali     94  Visavadar
2     ila     91   Junagadh

To transform data into spreadsheet

In [5]:
df.to_csv('friends.csv')

Tranform data into spreadsheet without index

In [6]:
df.to_csv('friends_index.csv', index = False)

In [7]:
df.head(2)

     name  marks       city
0  dhruvi     92    Bharuch
1  mirali     94  Visavadar

In [8]:
df.tail(2)

     name  marks       city
1  mirali     94  Visavadar
2     ila     91   Junagadh

In [9]:
df.describe

<bound method NDFrame.describe of      name  marks       city
0  dhruvi     92    Bharuch
1  mirali     94  Visavadar
2     ila     91   Junagadh>

To get quick analysis of dat

In [10]:
df.describe()

           marks
count   3.000000
mean   92.333333
std     1.527525
min    91.000000
25%    91.500000
50%    92.000000
75%    93.000000
max    94.000000

In [12]:
dhruvi = pd.read_csv('friends.csv')

In [13]:
dhruvi

   Unnamed: 0    name  marks       city
0           0  dhruvi     92    Bharuch
1           1  mirali     94  Visavadar
2           2     ila     91   Junagadh